{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "497c86f2-b94b-4faa-bd16-9a84556e3666",
   "metadata": {},
   "source": [
    "# TD 6"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8cdc2c47-3016-439c-a2bf-425628089fa8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded 102629 triples from expanded_kb_pruned.ttl\n",
      "\n",
      "=== Schema summary preview ===\n",
      "PREFIX brick: <https://brickschema.org/schema/Brick#>\n",
      "PREFIX csvw: <http://www.w3.org/ns/csvw#>\n",
      "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
      "PREFIX dcam: <http://purl.org/dc/dcam/>\n",
      "PREFIX dcat: <http://www.w3.org/ns/dcat#>\n",
      "PREFIX dcmitype: <http://purl.org/dc/dcmitype/>\n",
      "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
      "PREFIX doap: <http://usefulinc.com/ns/doap#>\n",
      "PREFIX ex: <http://example.org/>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
      "PREFIX odrl: <http://www.w3.org/ns/odrl/2/>\n",
      "PREFIX org: <http://www.w3.org/ns/org#>\n",
      "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX prof: <http://www.w3.org/ns/dx/prof/>\n",
      "PREFIX prov: <http://www.w3.org/ns/prov#>\n",
      "PREFIX qb: <http://purl.org/linked-data/cube#>\n",
      "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX schema: <https://schema.org/>\n",
      "PREFIX sh: <http://www.w3.org/ns/shacl#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "PREFIX sosa: <http://www.w3.org/ns/sosa/>\n",
      "PREFIX ssn: <http://www.w3.org/ns/ssn/>\n",
      "PREFIX time: <http://www.w3.org/2006/time#>\n",
      "PREFIX vann: <http://purl.org/vocab/vann/>\n",
      "PREFIX void: <http://rdfs.org/ns/void#>\n",
      "PREFIX wd: <http://www.wikidata.org/entity/>\n",
      "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
      "PREFIX wgs: <https://www.w3.org/2003/01/geo/wgs84_pos#>\n",
      "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
      "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
      "\n",
      "# Most frequent predicates (top 20)\n",
      "- wdt:P106 (occupation) [count=3094]\n",
      "- wdt:P31 (instance of) [count=2347]\n",
      "- wdt:P1412 [count=1953]\n",
      "- wdt:P27 (country of citizenship) [count=1907]\n",
      "- wdt:P17 (country) [count=1804]\n",
      "- wdt:P136 [count=1654]\n",
      "- wdt:P463 [count=1649]\n",
      "- wdt:P166 [count=1643]\n",
      "- wdt:P279 (subclass of) [count=1637]\n",
      "- wdt:P19 (place of birth) [count=1636]\n",
      "- wdt:P1303 [count=1586]\n",
      "- wdt:P20 [count=1583]\n",
      "- wdt:P101 [count=1578]\n",
      "- wdt:P495 (country of origin) [count=1577]\n",
      "- wdt:P840 [count=1562]\n",
      "- wdt:P915 [count=1559]\n",
      "- wdt:P364 [count=1558]\n",
      "- wdt:P462 [count=1555]\n",
      "- wdt:P86 [count=1550]\n",
      "- wdt:P921 [count=1548]\n",
      "\n",
      "# Most frequent classes via rdf:type (top 10)\n",
      "- rdfs:Class [count=6]\n",
      "- ex:Film [count=5]\n",
      "- ex:Person [count=3]\n",
      "\n",
      "# Sample triples\n",
      "- wd:Q9143 -- wdt:P361 --> wd:Q68\n",
      "- wd:Q4781103 -- wdt:P176 --> wd:Q312\n",
      "- wd:Q18168707 -- wdt:P102 --> wd:Q4266\n",
      "- wd:Q102410608 -- wdt:P108 --> wd:Q95\n",
      "- wd:Q5172728 -- wdt:P105 --> wd:Q4886\n",
      "- wd:Q122129875 -- wdt:P921 --> wd:Q4\n",
      "- wd:Q132757195 -- wdt:P1416 --> wd:Q9630\n",
      "- wd:Q251309 -- wdt:P175 --> wd:Q392\n",
      "\n",
      "==============================\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  What entities have a type?\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- Baseline (No RAG) ---\n",
      "I'm unsure about the specific entities that have a type. Different domains and contexts may have varying answers to this question. However, some common entities that are often associated with types include:\n",
      "\n",
      "1. Classes or types in object-oriented programming\n",
      "2. Data types in mathematics and computer science (e.g., numbers, strings, booleans)\n",
      "3. Concepts or categories in philosophy or ontology (e.g., human, animal, plant)\n",
      "4. Objects or instances in domain-specific models (e.g., cars, buildings, customers)\n",
      "\n",
      "It's essential to consider the context and specific domain being referred to when determining which entities have a type.\n",
      "\n",
      "--- SPARQL-generation RAG ---\n",
      "\n",
      "[DEBUG]\n",
      "Type: <class 'dict'>\n",
      "Content: {'query': 'SELECT ?entity ?type WHERE {\\n  ?entity wdt:P31 ?type .\\n}\\nLIMIT 20', 'vars': ['entity', 'type'], 'rows': [('http://www.wikidata.org/entity/Q100271070', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q101828437', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q102578013', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q10332541', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q104099133', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q104521362', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q104525006', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q104722140', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q104726622', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q105063744', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q105359643', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q1056362', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q105972604', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106131166', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106434434', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106468582', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106492974', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106528281', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q106538781', 'http://www.wikidata.org/entity/Q4'), ('http://www.wikidata.org/entity/Q1065865', 'http://www.wikidata.org/entity/Q4')], 'repaired': False, 'error': None}\n",
      "\n",
      "[SPARQL Query Used]\n",
      "SELECT ?entity ?type WHERE {\n",
      "  ?entity wdt:P31 ?type .\n",
      "}\n",
      "LIMIT 20\n",
      "\n",
      "[Repaired?]\n",
      "False\n",
      "\n",
      "[Results]\n",
      "entity | type\n",
      "http://www.wikidata.org/entity/Q100271070 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q101828437 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q102578013 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q10332541 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q104099133 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q104521362 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q104525006 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q104722140 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q104726622 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q105063744 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q105359643 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q1056362 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q105972604 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106131166 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106434434 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106468582 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106492974 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106528281 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q106538781 | http://www.wikidata.org/entity/Q4\n",
      "http://www.wikidata.org/entity/Q1065865 | http://www.wikidata.org/entity/Q4\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  List films in the graph\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- Baseline (No RAG) ---\n",
      "I'm unsure what kind of graph you're referring to or what type of information it contains. Could you please provide more context or clarify what you mean by \"list films in the graph\"?\n",
      "\n",
      "--- SPARQL-generation RAG ---\n",
      "\n",
      "[DEBUG]\n",
      "Type: <class 'dict'>\n",
      "Content: {'query': 'SELECT ?film \\nWHERE {\\n  ?film wdt:P161 ?castMember .\\n}\\nLIMIT 20', 'vars': ['film'], 'rows': [('http://www.wikidata.org/entity/Q100104941',), ('http://www.wikidata.org/entity/Q10331225',), ('http://www.wikidata.org/entity/Q1068968',), ('http://www.wikidata.org/entity/Q1070468',), ('http://www.wikidata.org/entity/Q1070484',), ('http://www.wikidata.org/entity/Q1088949',), ('http://www.wikidata.org/entity/Q109116',), ('http://www.wikidata.org/entity/Q1140172',), ('http://www.wikidata.org/entity/Q1140317',), ('http://www.wikidata.org/entity/Q1141431',), ('http://www.wikidata.org/entity/Q1148649',), ('http://www.wikidata.org/entity/Q1151392',), ('http://www.wikidata.org/entity/Q1151401',), ('http://www.wikidata.org/entity/Q1152833',), ('http://www.wikidata.org/entity/Q1191049',), ('http://www.wikidata.org/entity/Q1192082',), ('http://www.wikidata.org/entity/Q1195688',), ('http://www.wikidata.org/entity/Q1197772',), ('http://www.wikidata.org/entity/Q1211063',), ('http://www.wikidata.org/entity/Q1251918',)], 'repaired': True, 'error': None}\n",
      "\n",
      "[SPARQL Query Used]\n",
      "SELECT ?film \n",
      "WHERE {\n",
      "  ?film wdt:P161 ?castMember .\n",
      "}\n",
      "LIMIT 20\n",
      "\n",
      "[Repaired?]\n",
      "True\n",
      "\n",
      "[Results]\n",
      "film\n",
      "http://www.wikidata.org/entity/Q100104941\n",
      "http://www.wikidata.org/entity/Q10331225\n",
      "http://www.wikidata.org/entity/Q1068968\n",
      "http://www.wikidata.org/entity/Q1070468\n",
      "http://www.wikidata.org/entity/Q1070484\n",
      "http://www.wikidata.org/entity/Q1088949\n",
      "http://www.wikidata.org/entity/Q109116\n",
      "http://www.wikidata.org/entity/Q1140172\n",
      "http://www.wikidata.org/entity/Q1140317\n",
      "http://www.wikidata.org/entity/Q1141431\n",
      "http://www.wikidata.org/entity/Q1148649\n",
      "http://www.wikidata.org/entity/Q1151392\n",
      "http://www.wikidata.org/entity/Q1151401\n",
      "http://www.wikidata.org/entity/Q1152833\n",
      "http://www.wikidata.org/entity/Q1191049\n",
      "http://www.wikidata.org/entity/Q1192082\n",
      "http://www.wikidata.org/entity/Q1195688\n",
      "http://www.wikidata.org/entity/Q1197772\n",
      "http://www.wikidata.org/entity/Q1211063\n",
      "http://www.wikidata.org/entity/Q1251918\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  List persons in the graph\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- Baseline (No RAG) ---\n",
      "I'm unsure what \"the graph\" refers to. Could you please provide more context or information about the graph you're asking me to list from?\n",
      "\n",
      "--- SPARQL-generation RAG ---\n",
      "\n",
      "[DEBUG]\n",
      "Type: <class 'dict'>\n",
      "Content: {'query': 'SELECT ?person WHERE {\\n  ?person rdfs:label ?label .\\n}\\nLIMIT 20', 'vars': ['person'], 'rows': [], 'repaired': False, 'error': None}\n",
      "\n",
      "[SPARQL Query Used]\n",
      "SELECT ?person WHERE {\n",
      "  ?person rdfs:label ?label .\n",
      "}\n",
      "LIMIT 20\n",
      "\n",
      "[Repaired?]\n",
      "False\n",
      "\n",
      "[No rows returned]\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  What are the places of birth of entities?\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- Baseline (No RAG) ---\n",
      "I am unsure about the specific concept or definitions related to the \"places of birth\" of entities. The term could be interpreted in various ways depending on the context, and I don't have enough information to provide a clear answer. Can you please clarify or provide more context about what kind of entities you are referring to (e.g., people, organizations, concepts)?\n",
      "\n",
      "--- SPARQL-generation RAG ---\n",
      "\n",
      "[DEBUG]\n",
      "Type: <class 'dict'>\n",
      "Content: {'query': 'SELECT ?entity ?birthPlace \\nWHERE {\\n  ?entity wdt:P19 ?birthPlace .\\n}\\nLIMIT 20', 'vars': ['entity', 'birthPlace'], 'rows': [('http://www.wikidata.org/entity/Q1000980', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q1001117', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q100409588', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q100707255', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q100773481', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q100942395', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q100944917', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q101058617', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q101361616', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q102359222', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q102365406', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q102398925', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q102705092', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q10289434', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q10335648', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q104218041', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q104218081', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q10452295', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q104533044', 'http://www.wikidata.org/entity/Q16'), ('http://www.wikidata.org/entity/Q104723399', 'http://www.wikidata.org/entity/Q16')], 'repaired': False, 'error': None}\n",
      "\n",
      "[SPARQL Query Used]\n",
      "SELECT ?entity ?birthPlace \n",
      "WHERE {\n",
      "  ?entity wdt:P19 ?birthPlace .\n",
      "}\n",
      "LIMIT 20\n",
      "\n",
      "[Repaired?]\n",
      "False\n",
      "\n",
      "[Results]\n",
      "entity | birthPlace\n",
      "http://www.wikidata.org/entity/Q1000980 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q1001117 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q100409588 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q100707255 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q100773481 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q100942395 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q100944917 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q101058617 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q101361616 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q102359222 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q102365406 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q102398925 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q102705092 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q10289434 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q10335648 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q104218041 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q104218081 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q10452295 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q104533044 | http://www.wikidata.org/entity/Q16\n",
      "http://www.wikidata.org/entity/Q104723399 | http://www.wikidata.org/entity/Q16\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  What countries are associated with entities?\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "--- Baseline (No RAG) ---\n",
      "I'm unsure about specific countries that are directly associated with \"entities\" in a broad sense. However, some countries may be more commonly linked to concepts or ideas that are considered \"entities\" in various contexts.\n",
      "\n",
      "That being said, here are a few possibilities:\n",
      "\n",
      "1. Concepts: Entities can be abstract concepts, such as time, space, matter, energy, or even emotions.\n",
      "2. Fictional realms: Countries like Middle-earth (from J.R.R. Tolkien's works) or Wonderland (from Lewis Carroll's \"Alice's Adventures in Wonderland\") are associated with fantastical entities.\n",
      "3. Mythology and folklore: Certain countries have mythological or supernatural entities tied to them, such as the Japanese yokai or the Celtic Tuatha Dé Danann.\n",
      "\n",
      "If you could provide more context or clarify which type of entity you're referring to, I'd be happy to try and help further!\n",
      "\n",
      "--- SPARQL-generation RAG ---\n",
      "\n",
      "[DEBUG]\n",
      "Type: <class 'dict'>\n",
      "Content: {'query': 'SELECT ?entity ?country WHERE {\\n  ?entity wdt:P17 ?country .\\n}\\nLIMIT 20', 'vars': ['entity', 'country'], 'rows': [('http://www.wikidata.org/entity/Q100534639', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1026941', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q103360', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q103618', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1044427', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1044835', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q105304', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1062026', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q106301', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q106800', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1071445', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q107258', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1077109', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1093910', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q111332', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q112243', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1131772', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1141037', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1161102', 'http://www.wikidata.org/entity/Q30'), ('http://www.wikidata.org/entity/Q1161103', 'http://www.wikidata.org/entity/Q30')], 'repaired': False, 'error': None}\n",
      "\n",
      "[SPARQL Query Used]\n",
      "SELECT ?entity ?country WHERE {\n",
      "  ?entity wdt:P17 ?country .\n",
      "}\n",
      "LIMIT 20\n",
      "\n",
      "[Repaired?]\n",
      "False\n",
      "\n",
      "[Results]\n",
      "entity | country\n",
      "http://www.wikidata.org/entity/Q100534639 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1026941 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q103360 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q103618 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1044427 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1044835 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q105304 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1062026 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q106301 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q106800 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1071445 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q107258 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1077109 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1093910 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q111332 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q112243 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1131772 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1141037 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1161102 | http://www.wikidata.org/entity/Q30\n",
      "http://www.wikidata.org/entity/Q1161103 | http://www.wikidata.org/entity/Q30\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Question (or 'quit'):  quit\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "import requests\n",
    "from typing import List, Tuple\n",
    "from rdflib import Graph\n",
    "\n",
    "# ----------------------------\n",
    "# Configuration\n",
    "# ----------------------------\n",
    "TTL_FILE = \"expanded_kb_pruned.ttl\"\n",
    "OLLAMA_URL = \"http://localhost:11434/api/generate\"\n",
    "MODEL_NAME = \"llama3.2:3b\"\n",
    "\n",
    "MAX_PREDICATES = 20\n",
    "MAX_CLASSES = 10\n",
    "SAMPLE_TRIPLES = 8\n",
    "\n",
    "# ----------------------------\n",
    "# 0) Appel du LLM local via Ollama\n",
    "# ----------------------------\n",
    "def ask_local_llm(prompt: str, model: str = MODEL_NAME) -> str:\n",
    "    payload = {\n",
    "        \"model\": model,\n",
    "        \"prompt\": prompt,\n",
    "        \"stream\": False\n",
    "    }\n",
    "\n",
    "    try:\n",
    "        response = requests.post(OLLAMA_URL, json=payload, timeout=300)\n",
    "    except requests.exceptions.Timeout:\n",
    "        raise RuntimeError(\"Ollama timed out. Try reducing the schema summary or increasing timeout.\")\n",
    "\n",
    "    if response.status_code != 200:\n",
    "        raise RuntimeError(f\"Ollama API error {response.status_code}: {response.text}\")\n",
    "\n",
    "    data = response.json()\n",
    "    return data.get(\"response\", \"\").strip()\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 1) Charger le graphe RDF\n",
    "# ----------------------------\n",
    "def load_graph(ttl_path: str) -> Graph:\n",
    "    g = Graph()\n",
    "    g.parse(ttl_path, format=\"turtle\")\n",
    "    print(f\"Loaded {len(g)} triples from {ttl_path}\")\n",
    "    return g\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 2) Aide pour afficher des URI lisibles\n",
    "# ----------------------------\n",
    "def shorten_uri(term, g: Graph) -> str:\n",
    "    \"\"\"\n",
    "    Transforme une URI complète en forme compacte si possible.\n",
    "    Ex: http://www.wikidata.org/prop/direct/P31 -> wdt:P31\n",
    "    \"\"\"\n",
    "    try:\n",
    "        return g.namespace_manager.normalizeUri(term)\n",
    "    except Exception:\n",
    "        return str(term)\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 3) Construire un petit schema summary\n",
    "# ----------------------------\n",
    "def get_prefix_block(g: Graph) -> str:\n",
    "    defaults = {\n",
    "        \"rdf\": \"http://www.w3.org/1999/02/22-rdf-syntax-ns#\",\n",
    "        \"rdfs\": \"http://www.w3.org/2000/01/rdf-schema#\",\n",
    "        \"xsd\": \"http://www.w3.org/2001/XMLSchema#\",\n",
    "        \"owl\": \"http://www.w3.org/2002/07/owl#\",\n",
    "    }\n",
    "\n",
    "    ns_map = {p: str(ns) for p, ns in g.namespace_manager.namespaces()}\n",
    "    for k, v in defaults.items():\n",
    "        ns_map.setdefault(k, v)\n",
    "\n",
    "    lines = [f\"PREFIX {p}: <{ns}>\" for p, ns in ns_map.items()]\n",
    "    return \"\\n\".join(sorted(lines))\n",
    "\n",
    "\n",
    "def list_top_predicates(g: Graph, limit: int = MAX_PREDICATES) -> List[Tuple[str, int]]:\n",
    "    q = f\"\"\"\n",
    "    SELECT ?p (COUNT(*) AS ?count) WHERE {{\n",
    "      ?s ?p ?o .\n",
    "    }}\n",
    "    GROUP BY ?p\n",
    "    ORDER BY DESC(?count)\n",
    "    LIMIT {limit}\n",
    "    \"\"\"\n",
    "    preds = []\n",
    "    for row in g.query(q):\n",
    "        preds.append((shorten_uri(row[\"p\"], g), int(row[\"count\"])))\n",
    "    return preds\n",
    "\n",
    "\n",
    "def list_top_classes(g: Graph, limit: int = MAX_CLASSES) -> List[Tuple[str, int]]:\n",
    "    q = f\"\"\"\n",
    "    SELECT ?cls (COUNT(*) AS ?count) WHERE {{\n",
    "      ?s a ?cls .\n",
    "    }}\n",
    "    GROUP BY ?cls\n",
    "    ORDER BY DESC(?count)\n",
    "    LIMIT {limit}\n",
    "    \"\"\"\n",
    "    clss = []\n",
    "    for row in g.query(q):\n",
    "        clss.append((shorten_uri(row[\"cls\"], g), int(row[\"count\"])))\n",
    "    return clss\n",
    "\n",
    "\n",
    "\n",
    "def sample_triples(g: Graph, limit: int = SAMPLE_TRIPLES) -> List[Tuple[str, str, str]]:\n",
    "    q = f\"\"\"\n",
    "    SELECT ?s ?p ?o WHERE {{\n",
    "      ?s ?p ?o .\n",
    "      FILTER(isIRI(?s) && isIRI(?p))\n",
    "    }}\n",
    "    LIMIT {limit}\n",
    "    \"\"\"\n",
    "    triples = []\n",
    "    for r in g.query(q):\n",
    "        triples.append((\n",
    "            shorten_uri(r.s, g),\n",
    "            shorten_uri(r.p, g),\n",
    "            shorten_uri(r.o, g)\n",
    "        ))\n",
    "    return triples\n",
    "\n",
    "PROPERTY_HINTS = {\n",
    "    \"wdt:P31\": \"instance of\",\n",
    "    \"wdt:P17\": \"country\",\n",
    "    \"wdt:P19\": \"place of birth\",\n",
    "    \"wdt:P21\": \"sex or gender\",\n",
    "    \"wdt:P27\": \"country of citizenship\",\n",
    "    \"wdt:P106\": \"occupation\",\n",
    "    \"wdt:P161\": \"cast member\",\n",
    "    \"wdt:P279\": \"subclass of\",\n",
    "    \"wdt:P495\": \"country of origin\",\n",
    "    \"wdt:P569\": \"date of birth\",\n",
    "    \"wdt:P570\": \"date of death\",\n",
    "}\n",
    "\n",
    "def explain_term(term: str) -> str:\n",
    "    if term in PROPERTY_HINTS:\n",
    "        return f\"{term} ({PROPERTY_HINTS[term]})\"\n",
    "    return term\n",
    "\n",
    "\n",
    "def build_schema_summary(g: Graph) -> str:\n",
    "    prefixes = get_prefix_block(g)\n",
    "    preds = list_top_predicates(g)\n",
    "    clss = list_top_classes(g)\n",
    "    samples = sample_triples(g)\n",
    "\n",
    "    pred_lines = \"\\n\".join(\n",
    "        f\"- {explain_term(p)} [count={c}]\"\n",
    "        for p, c in preds\n",
    "    )\n",
    "\n",
    "    cls_lines = \"\\n\".join(\n",
    "        f\"- {c} [count={n}]\"\n",
    "        for c, n in clss\n",
    "    )\n",
    "\n",
    "    sample_lines = \"\\n\".join(\n",
    "        f\"- {s} -- {explain_term(p)} --> {o}\"\n",
    "        for s, p, o in samples\n",
    "    )\n",
    "\n",
    "    summary = f\"\"\"\n",
    "{prefixes}\n",
    "\n",
    "# Most frequent predicates (top {MAX_PREDICATES})\n",
    "{pred_lines}\n",
    "\n",
    "# Most frequent classes via rdf:type (top {MAX_CLASSES})\n",
    "{cls_lines}\n",
    "\n",
    "# Sample triples\n",
    "{sample_lines}\n",
    "\"\"\"\n",
    "    return summary.strip()\n",
    "\n",
    "def build_question_aware_summary(g: Graph, question: str) -> str:\n",
    "    base = build_schema_summary(g)\n",
    "\n",
    "    hints = []\n",
    "    q = question.lower()\n",
    "\n",
    "    if \"type\" in q:\n",
    "        hints.append(\"- wdt:P31 (instance of)\")\n",
    "    if \"birth\" in q or \"born\" in q:\n",
    "        hints.append(\"- wdt:P19 (place of birth)\")\n",
    "        hints.append(\"- wdt:P569 (date of birth)\")\n",
    "        hints.append(\"- wdt:P27 (country of citizenship)\")\n",
    "    if \"country\" in q:\n",
    "        hints.append(\"- wdt:P17 (country)\")\n",
    "        hints.append(\"- wdt:P495 (country of origin)\")\n",
    "    if \"film\" in q or \"movie\" in q:\n",
    "        hints.append(\"- ex:Film\")\n",
    "        hints.append(\"- wdt:P161 (cast member)\")\n",
    "\n",
    "    if hints:\n",
    "        return base + \"\\n\\n# Question-relevant hints\\n\" + \"\\n\".join(hints)\n",
    "\n",
    "    return base\n",
    "\n",
    "# ----------------------------\n",
    "# 4) Génération SPARQL\n",
    "# ----------------------------\n",
    "SPARQL_INSTRUCTIONS = \"\"\"\n",
    "You generate SPARQL 1.1 SELECT queries for an RDF graph.\n",
    "\n",
    "Rules:\n",
    "- Use only prefixes, predicates, classes, and entities explicitly shown in the schema summary.\n",
    "- Do not invent properties or entities.\n",
    "- Return exactly one SPARQL query inside a fenced ```sparql code block.\n",
    "- Return a SELECT query only.\n",
    "- Keep the query short and robust.\n",
    "- Always include LIMIT 20 unless the question clearly requires a different limit.\n",
    "- Prefer direct triples over complex OPTIONAL patterns.\n",
    "- If the question asks about \"type\", prefer wdt:P31.\n",
    "- Wikidata-style entities look like wd:Qxxx.\n",
    "- Wikidata-style properties look like wdt:Pxxx.\n",
    "- If the answer is uncertain, still produce the safest simple query based only on the schema summary.\n",
    "\n",
    "Example:\n",
    "Question: What entities have a type?\n",
    "SPARQL:\n",
    "```sparql\n",
    "SELECT ?entity ?type WHERE {\n",
    "  ?entity wdt:P31 ?type .\n",
    "}\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "CODE_BLOCK_RE = re.compile(r\"```(?:sparql)?\\s*(.*?)```\", re.IGNORECASE | re.DOTALL)\n",
    "\n",
    "def extract_sparql_from_text(text: str) -> str:\n",
    "    m = CODE_BLOCK_RE.search(text)\n",
    "    if m:\n",
    "        return m.group(1).strip()\n",
    "    return text.strip()\n",
    "\n",
    "\n",
    "def make_sparql_prompt(schema_summary: str, question: str) -> str:\n",
    "    return f\"\"\"{SPARQL_INSTRUCTIONS}\n",
    "\n",
    "SCHEMA SUMMARY:\n",
    "{schema_summary}\n",
    "\n",
    "QUESTION:\n",
    "{question}\n",
    "\n",
    "Return only the SPARQL query in a code block.\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "def generate_sparql(question: str, schema_summary: str) -> str:\n",
    "    raw = ask_local_llm(make_sparql_prompt(schema_summary, question))\n",
    "    return extract_sparql_from_text(raw)\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 5) Exécution SPARQL\n",
    "# ----------------------------\n",
    "def run_sparql(g: Graph, query: str) -> Tuple[List[str], List[Tuple[str, ...]]]:\n",
    "    res = g.query(query)\n",
    "    vars_ = [str(v) for v in res.vars]\n",
    "    rows = [tuple(str(cell) if cell is not None else \"\" for cell in r) for r in res]\n",
    "    return vars_, rows\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 6) Self-repair\n",
    "# ----------------------------\n",
    "REPAIR_INSTRUCTIONS = \"\"\"\n",
    "The previous SPARQL failed to execute. Using the SCHEMA SUMMARY and the ERROR MESSAGE,\n",
    "return a corrected SPARQL 1.1 SELECT query.\n",
    "\n",
    "Follow strictly:\n",
    "- Use only known prefixes, predicates, and terms shown in the schema summary.\n",
    "- Keep the query simple and robust.\n",
    "- If a prefix is missing, add it.\n",
    "- If labels are not reliable, avoid them.\n",
    "- Return only a single fenced code block labeled ```sparql\n",
    "\"\"\"\n",
    "\n",
    "def repair_sparql(schema_summary: str, question: str, bad_query: str, error_msg: str) -> str:\n",
    "    prompt = f\"\"\"{REPAIR_INSTRUCTIONS}\n",
    "\n",
    "SCHEMA SUMMARY:\n",
    "{schema_summary}\n",
    "\n",
    "ORIGINAL QUESTION:\n",
    "{question}\n",
    "\n",
    "BAD SPARQL:\n",
    "{bad_query}\n",
    "\n",
    "ERROR MESSAGE:\n",
    "{error_msg}\n",
    "\n",
    "Return only the corrected SPARQL in a code block.\n",
    "\"\"\"\n",
    "    raw = ask_local_llm(prompt)\n",
    "    return extract_sparql_from_text(raw)\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 7) Pipeline RAG\n",
    "# ----------------------------\n",
    "def validate_sparql_candidate(query: str) -> None:\n",
    "    q = query.strip().lower()\n",
    "    if not q:\n",
    "        raise ValueError(\"Empty SPARQL query generated.\")\n",
    "    if \"select\" not in q:\n",
    "        raise ValueError(\"Only SELECT queries are allowed.\")\n",
    "\n",
    "def answer_with_sparql_generation(\n",
    "    g: Graph,\n",
    "    schema_summary: str,\n",
    "    question: str,\n",
    "    try_repair: bool = True\n",
    ") -> dict:\n",
    "    try:\n",
    "        sparql = generate_sparql(question, schema_summary)\n",
    "    except Exception as e:\n",
    "        return {\n",
    "            \"query\": \"\",\n",
    "            \"vars\": [],\n",
    "            \"rows\": [],\n",
    "            \"repaired\": False,\n",
    "            \"error\": f\"SPARQL generation failed: {e}\"\n",
    "        }\n",
    "\n",
    "    try:\n",
    "        vars_, rows = run_sparql(g, sparql)\n",
    "        return {\n",
    "            \"query\": sparql,\n",
    "            \"vars\": vars_,\n",
    "            \"rows\": rows,\n",
    "            \"repaired\": False,\n",
    "            \"error\": None\n",
    "        }\n",
    "\n",
    "    except Exception as e:\n",
    "        first_error = str(e)\n",
    "\n",
    "        if try_repair:\n",
    "            try:\n",
    "                repaired_query = repair_sparql(schema_summary, question, sparql, first_error)\n",
    "\n",
    "                vars_, rows = run_sparql(g, repaired_query)\n",
    "                return {\n",
    "                    \"query\": repaired_query,\n",
    "                    \"vars\": vars_,\n",
    "                    \"rows\": rows,\n",
    "                    \"repaired\": True,\n",
    "                    \"error\": None\n",
    "                }\n",
    "\n",
    "            except Exception as e2:\n",
    "                return {\n",
    "                    \"query\": repaired_query if \"repaired_query\" in locals() else sparql,\n",
    "                    \"vars\": [],\n",
    "                    \"rows\": [],\n",
    "                    \"repaired\": True,\n",
    "                    \"error\": str(e2)\n",
    "                }\n",
    "\n",
    "        return {\n",
    "            \"query\": sparql,\n",
    "            \"vars\": [],\n",
    "            \"rows\": [],\n",
    "            \"repaired\": False,\n",
    "            \"error\": first_error\n",
    "        }\n",
    "\n",
    "# ----------------------------\n",
    "# 8) Baseline sans RAG\n",
    "# ----------------------------\n",
    "def answer_no_rag(question: str) -> str:\n",
    "    prompt = f\"\"\"Answer the following question as best as you can.\n",
    "If you are unsure, say you are unsure.\n",
    "\n",
    "Question:\n",
    "{question}\n",
    "\"\"\"\n",
    "    return ask_local_llm(prompt)\n",
    "\n",
    "\n",
    "# ----------------------------\n",
    "# 9) Affichage CLI\n",
    "# ----------------------------\n",
    "def pretty_print_result(result: dict) -> None:\n",
    "    if result is None:\n",
    "        print(\"\\n[Error] No result returned by answer_with_sparql_generation().\")\n",
    "        return\n",
    "\n",
    "    if result.get(\"error\"):\n",
    "        print(\"\\n[Execution Error]\")\n",
    "        print(result[\"error\"])\n",
    "\n",
    "    print(\"\\n[SPARQL Query Used]\")\n",
    "    print(result.get(\"query\", \"\"))\n",
    "\n",
    "    print(\"\\n[Repaired?]\")\n",
    "    print(result.get(\"repaired\", False))\n",
    "\n",
    "    vars_ = result.get(\"vars\", [])\n",
    "    rows = result.get(\"rows\", [])\n",
    "\n",
    "    if not rows:\n",
    "        print(\"\\n[No rows returned]\")\n",
    "        return\n",
    "\n",
    "    print(\"\\n[Results]\")\n",
    "    print(\" | \".join(vars_))\n",
    "    for r in rows[:20]:\n",
    "        print(\" | \".join(r))\n",
    "\n",
    "    if len(rows) > 20:\n",
    "        print(f\"... (showing 20 of {len(rows)})\")\n",
    "        \n",
    "# ----------------------------\n",
    "# 10) Main\n",
    "# ----------------------------\n",
    "if __name__ == \"__main__\":\n",
    "    g = load_graph(TTL_FILE)\n",
    "    schema = build_schema_summary(g)\n",
    "\n",
    "    print(\"\\n=== Schema summary preview ===\")\n",
    "    print(schema[:3000])\n",
    "    print(\"\\n==============================\")\n",
    "\n",
    "    while True:\n",
    "        q = input(\"\\nQuestion (or 'quit'): \").strip()\n",
    "        if q.lower() == \"quit\":\n",
    "            break\n",
    "\n",
    "        # version question-aware\n",
    "        question_schema = build_question_aware_summary(g, q)\n",
    "\n",
    "        print(\"\\n--- Baseline (No RAG) ---\")\n",
    "        try:\n",
    "            print(answer_no_rag(q))\n",
    "        except Exception as e:\n",
    "            print(f\"Baseline failed: {e}\")\n",
    "\n",
    "        print(\"\\n--- SPARQL-generation RAG ---\")\n",
    "\n",
    "        result = answer_with_sparql_generation(g, question_schema, q, try_repair=True)\n",
    "\n",
    "        # DEBUG\n",
    "        print(\"\\n[DEBUG]\")\n",
    "        print(\"Type:\", type(result))\n",
    "        print(\"Content:\", result)\n",
    "\n",
    "        pretty_print_result(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6882401a-3d78-49c3-8989-a8b6d71773c0",
   "metadata": {},
   "source": [
    "# TD6 – Retrieval-Augmented Generation with RDF/SPARQL and a Local Small LLM\n",
    "\n",
    "## 1. Introduction\n",
    "\n",
    "In this lab, we implemented a **Retrieval-Augmented Generation (RAG)** system using an RDF knowledge graph and a local small language model (LLM).\n",
    "\n",
    "The objective was to answer natural language questions by generating SPARQL queries and retrieving results from a structured knowledge base.\n",
    "\n",
    "Unlike a standard LLM, which may produce vague or hallucinated answers, this approach ensures that responses are **grounded in factual data** stored in the RDF graph.\n",
    "\n",
    "---\n",
    "\n",
    "## 2. Setup\n",
    "\n",
    "### Tools\n",
    "\n",
    "- Python ≥ 3.9  \n",
    "- rdflib (for RDF loading and SPARQL queries)  \n",
    "- requests (for API calls)  \n",
    "- Ollama (local LLM server)  \n",
    "\n",
    "### Model\n",
    "\n",
    "- `llama3.2:3b`\n",
    "\n",
    "### Knowledge Graph\n",
    "\n",
    "- File: `expanded_kb_pruned.ttl`  \n",
    "- Size: **102,629 triples**\n",
    "\n",
    "The graph follows a **Wikidata-style structure**, using:\n",
    "\n",
    "- Entities: `wd:Qxxx`  \n",
    "- Predicates: `wdt:Pxxx`  \n",
    "\n",
    "Examples of important predicates:\n",
    "\n",
    "- `wdt:P31` → instance of  \n",
    "- `wdt:P19` → place of birth  \n",
    "- `wdt:P17` → country  \n",
    "- `wdt:P106` → occupation  \n",
    "\n",
    "---\n",
    "\n",
    "## 3. Methodology\n",
    "\n",
    "### 3.1 Pipeline\n",
    "\n",
    "The system follows the pipeline below:\n",
    "\n",
    "1. Load the RDF graph  \n",
    "2. Build a schema summary (prefixes, predicates, classes)  \n",
    "3. Convert natural language → SPARQL using the LLM  \n",
    "4. Execute the SPARQL query using rdflib  \n",
    "5. Return the results  \n",
    "6. Apply self-repair if the query fails  \n",
    "\n",
    "---\n",
    "\n",
    "### 3.2 Schema Summary\n",
    "\n",
    "A compact schema summary is generated to guide the LLM. It includes:\n",
    "\n",
    "- Prefixes  \n",
    "- Most frequent predicates  \n",
    "- Most frequent classes  \n",
    "- Sample triples  \n",
    "\n",
    "To improve performance and avoid timeouts, the summary size was reduced.\n",
    "\n",
    "---\n",
    "\n",
    "### 3.3 SPARQL Generation\n",
    "\n",
    "The LLM is prompted to generate SPARQL queries from natural language questions.\n",
    "\n",
    "Example:\n",
    "\n",
    "```sparql\n",
    "SELECT ?entity ?type WHERE {\n",
    "  ?entity wdt:P31 ?type .\n",
    "}\n",
    "LIMIT 20\n",
    "\n",
    "Prompt engineering was used to:\n",
    "\n",
    "- avoid hallucinated predicates  \n",
    "- enforce valid SPARQL syntax  \n",
    "- guide the model toward simple queries  \n",
    "\n",
    "\n",
    "\n",
    "### 3.4 Self-Repair Mechanism\n",
    "\n",
    "If a SPARQL query fails:\n",
    "\n",
    "- The error message is captured  \n",
    "- The LLM receives the error  \n",
    "- A corrected query is generated  \n",
    "\n",
    "This improves the robustness of the system.\n",
    "\n",
    "---\n",
    "\n",
    "### 3.5 Baseline vs RAG\n",
    "\n",
    "Two approaches were compared:\n",
    "\n",
    "- **Baseline:** LLM answers directly (no retrieval)  \n",
    "- **RAG:** LLM generates SPARQL queries and retrieves results  \n",
    "\n",
    "---\n",
    "\n",
    "## 4. Experimental Results\n",
    "\n",
    "| Question | Baseline | RAG Result | Correct |\n",
    "|----------|--------|------------|--------|\n",
    "| What entities have a type? | Generic answer | Correct SPARQL + results | Yes |\n",
    "| List films in the graph | No answer | Works (approximate via cast relation) | Partial |\n",
    "| List persons in the graph | No answer | Incorrect query | No |\n",
    "| What are the places of birth of entities? | Vague | Correct results | Yes |\n",
    "| What countries are associated with entities? | Vague | Correct results | Yes |\n",
    "\n",
    "---\n",
    "\n",
    "## 5. Analysis\n",
    "\n",
    "### 5.1 Baseline Performance\n",
    "\n",
    "The baseline model:\n",
    "\n",
    "- Produces vague and generic answers  \n",
    "- Is not grounded in the RDF graph  \n",
    "- Cannot answer domain-specific questions  \n",
    "\n",
    "---\n",
    "\n",
    "### 5.2 RAG Performance\n",
    "\n",
    "The RAG system:\n",
    "\n",
    "- Produces structured and factual answers  \n",
    "- Retrieves real data from the knowledge graph  \n",
    "- Is significantly more reliable than the baseline  \n",
    "\n",
    "---\n",
    "\n",
    "### 5.3 Observed Issues\n",
    "\n",
    "Several issues were observed:\n",
    "\n",
    "- Incorrect use of `rdfs:label` instead of `rdf:type`  \n",
    "- Some queries required self-repair  \n",
    "- Syntax errors (e.g., trailing `;`)  \n",
    "- Model confusion due to Wikidata identifiers (`wd:Qxxx`, `wdt:Pxxx`)  \n",
    "- Small LLM limitations on complex schemas  \n",
    "\n",
    "---\n",
    "\n",
    "### 5.4 Example of Successful Query\n",
    "\n",
    "**Question:** What entities have a type?\n",
    "\n",
    "Generated query:\n",
    "\n",
    "```sparql\n",
    "SELECT ?entity ?type WHERE {\n",
    "  ?entity wdt:P31 ?type .\n",
    "}\n",
    "LIMIT 20"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "84bc45c2-019f-4b43-b05b-3567420bd37d",
   "metadata": {},
   "source": [
    "6. Scalability Discussion\n",
    "Strengths\n",
    "Works well with structured RDF data\n",
    "Provides explainable results\n",
    "Avoids hallucination\n",
    "Limitations\n",
    "Small LLM struggles with complex schemas\n",
    "Query generation is fragile\n",
    "Performance depends heavily on prompt design\n",
    "Not easily scalable without larger models\n",
    "7. Conclusion\n",
    "\n",
    "This lab demonstrates that:\n",
    "\n",
    "LLM alone produces ungrounded and unreliable answers\n",
    "RAG significantly improves accuracy and factual grounding\n",
    "The main challenge is SPARQL query generation, especially with small models\n",
    "\n",
    "Overall, SPARQL-based RAG is effective but requires careful prompt design.\n",
    "\n",
    "8. Key Takeaways\n",
    "RAG reduces hallucination\n",
    "Prompt engineering is critical\n",
    "Small models require simplification\n",
    "SPARQL errors must be handled"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "585558ca-9a48-449a-a40e-5fc5542c62d0",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
